Revit 2026 API

# ParameterValue Methods

---

The ParameterValue type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Copy | Makes an identical copy of the given parameter value. |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsEqual | Tests equality with another instance of the same class. |
|  | IsSameType | Tests another instance is of the same value type. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

ParameterValue Class

Autodesk.Revit.DB Namespace